Autodesk.Revit.DB.SiteLocation.SaveToLinkType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Save the site into specific LinkType, if the type has one already, it will be updated
document:
The document of the LinkType.
linkTypeId:
The LinkType to be saved into.
geoSiteName:
The site name to save.
geoCoordinateSystem:
The coordinate system name to save.
Returns:
The saved site.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element linkTypeId does not exist in the document
-or-
geoSiteName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.SiteLocation.DownloadWeatherFile(System.String)
Downloads the weather file at this site location, used for systems energy analysis.
weatherFolder:
The folder location where the downloaded weather file will be stored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
No weather station is within 500 nautical miles of this site location.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Fail to download the weather file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to access the weather service. Try again later.
Since:
2020.1

Autodesk.Revit.DB.SiteLocation.IsCompatibleWith(Autodesk.Revit.DB.SiteLocation)
Checks whether the geographic coordinate system of this site is compatible with the given site .
True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.SiteLocation.SetGeoCoordinateSystem(System.String)
Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI.
Remarks:
The ID, WKT or Autodesk coordinate system xml representation of the coordinate reference system definition.
The xml representation is the same format get via RealDWG's API - AcDbGeoData::coordinateSystem.
Optionally, the string can be prefixed by the ID's namespace and a colon (:) where the following are supported: ADSK, EPSG.
If no namespace has been specified, the ID is assumed to be a default Autodesk coordinate system identifier.
If no definition exists with such a code and if it consists of numbers only, the ID string is considered an EPSG code.
Valid examples are:
LL84 > Autodesk identifier (default)ADSK:LL84 > Autodesk identifierEPSG:4326 > EPSG identifier4326 > EPSG identifierGEOGCS["WGS 84", DATUM["WGS_1984", SPHEROID[...]]] > WKT
coordSystem:
The coordinate system to set for the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
coordSystem is an empty string or contains only whitespace.
-or-
The coordinate system is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InternalException:
Fail to update coordinate system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The site location does not come from the project.
Since:
2019.2

Autodesk.Revit.DB.SiteLocation.PlaceName
The place name of the site.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013